--
-- PostgreSQL database dump
--

-- Dumped from database version 17.5
-- Dumped by pg_dump version 17.5

-- Started on 2025-07-17 22:21:16

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- TOC entry 4979 (class 0 OID 16396)
-- Dependencies: 218
-- Data for Name: Locales; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."Locales" ("Id", "Name", "Code", "Direction", "IsDefault", "IsDeleted", "CreatedBy", "Sort", "CreatedAt", "ModifiedBy", "ModifiedAt", "IsPublished", "PublishedAt", "PublishedBy", "DeletedAt", "DeletedBy", "IsNeedDeleteApprove", "IsActive", "Title") FROM stdin;
b11476d7-fc17-430b-817c-59b30cc51e36	English	en	LTR	f	f	00000000-0000-0000-0000-000000000000	2	2025-01-05 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t	English
2e10d250-92c8-4870-bd44-8be4969693a4	Arabic	ar	RTL	t	f	00000000-0000-0000-0000-000000000000	1	2025-01-08 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t	العربية
033f208e-c6b2-42e0-9f18-f7fb9d4e18c0	Turkish	tr	LTR	f	f	00000000-0000-0000-0000-000000000000	6	2025-01-15 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Türkçe
28366442-ef30-4624-b847-7b6f2d36d2bc	German	de	LTR	f	f	00000000-0000-0000-0000-000000000000	9	2025-01-07 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Deutsch
39ec1b5b-d359-441b-aff3-966d35bf1a11	Georgian	ka	LTR	f	f	00000000-0000-0000-0000-000000000000	8	2025-01-09 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	ქართული
69bf9bf1-813e-4d52-9ba0-4c6ebf2e820f	Korean	ko	LTR	f	f	00000000-0000-0000-0000-000000000000	13	2025-01-03 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	한국어 (韓國語), 조선말 (朝鮮語)
6a8b1219-7e67-47f6-bb25-a510ba5ee819	Japanese	ja	LTR	f	f	00000000-0000-0000-0000-000000000000	12	2025-01-10 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	日本語 (にほんご／にっぽんご)
80d5e0aa-1f95-4267-8615-6b33a034ac30	Swedish	sv	LTR	f	f	00000000-0000-0000-0000-000000000000	16	2025-01-06 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	svenska
8a596d02-86f8-489a-9be5-b7022cc9050e	Indonesian	id	LTR	f	f	00000000-0000-0000-0000-000000000000	11	2025-01-11 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Bahasa Indonesia
93ef7875-c184-4db6-9780-d80d1e3e91df	French	fr	LTR	f	f	00000000-0000-0000-0000-000000000000	3	2025-01-14 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Français
990972c2-8995-4a72-b506-4eb47802846c	Hindi	hi	LTR	f	f	00000000-0000-0000-0000-000000000000	7	2025-01-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	हिन्दी, हिंदी
ae6645b2-d69b-4f73-a766-1ac6e79440e4	Italian	it	LTR	f	f	00000000-0000-0000-0000-000000000000	5	2025-01-02 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Italiano
afeba9d9-5b5e-45cb-86d1-f5186ba0f6f6	Greek, Modern	el	LTR	f	f	00000000-0000-0000-0000-000000000000	10	2025-01-15 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Ελληνικά
b3f4a58c-68d9-48c2-84a2-cb8c30bbca5b	Norwegian	no	LTR	f	f	00000000-0000-0000-0000-000000000000	14	2025-01-12 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	Norsk
ce760334-1111-4186-a677-0a73da4490d7	Spanish	es	LTR	f	f	00000000-0000-0000-0000-000000000000	4	2025-01-01 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	español
f3fbcccb-606e-457c-92a9-d01dfb1a7a15	Romanian, Moldavian, Moldovan	ro	LTR	f	f	00000000-0000-0000-0000-000000000000	15	2025-01-13 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	f	română
\.


--
-- TOC entry 4980 (class 0 OID 16403)
-- Dependencies: 219
-- Data for Name: Permissions; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."Permissions" ("Id", "Name", "Title", "IsStatic", "IsDeleted", "CreatedBy", "Sort", "CreatedAt", "ModifiedBy", "ModifiedAt", "IsPublished", "PublishedAt", "PublishedBy", "DeletedAt", "DeletedBy", "IsNeedDeleteApprove", "IsActive") FROM stdin;
04e87bc1-655d-4b0b-402b-08dbad215992	Edit	Edit	f	f	00000000-0000-0000-0000-000000000000	4	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
062c17a9-21e5-4fe9-402c-08dbad215992	Approve	Approve	f	f	00000000-0000-0000-0000-000000000000	5	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
20651947-a5a0-4e62-4030-08dbad215992	Design	Design	f	f	00000000-0000-0000-0000-000000000000	9	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
235f2f00-1c5e-460c-4028-08dbad215992	FullControl	Full Control	f	f	00000000-0000-0000-0000-000000000000	1	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
2c1b4d4b-3bb1-44f7-4029-08dbad215992	Read	Read	f	f	00000000-0000-0000-0000-000000000000	2	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
6308a7f3-a865-4fac-4031-08dbad215992	ReportViewer	Report Viewer	f	f	00000000-0000-0000-0000-000000000000	10	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
83ac5a1f-0e9f-48c7-402d-08dbad215992	Publish	Publish	f	f	00000000-0000-0000-0000-000000000000	6	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
aef199e5-ae5c-4334-402e-08dbad215992	Manage	Manage	f	f	00000000-0000-0000-0000-000000000000	7	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
d9a98bfa-080e-4c6b-402a-08dbad215992	Contribute	Contribute	f	f	00000000-0000-0000-0000-000000000000	3	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
e0a1c562-512f-4073-4032-08dbad215992	Deny	Deny	f	f	00000000-0000-0000-0000-000000000000	11	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
fc484495-dec9-4cd9-402f-08dbad215992	Delete	Delete	f	f	00000000-0000-0000-0000-000000000000	8	2023-09-04 00:00:00+03	\N	\N	t	\N	\N	\N	\N	f	t
\.


--
-- TOC entry 4992 (class 0 OID 16484)
-- Dependencies: 231
-- Data for Name: PostCategories; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."PostCategories" ("Id", "Name", "IsDeleted", "CreatedBy", "Sort", "CreatedAt", "ModifiedBy", "ModifiedAt", "IsPublished", "PublishedAt", "PublishedBy", "DeletedAt", "DeletedBy", "IsNeedDeleteApprove", "IsActive") FROM stdin;
35121ed1-acc5-4224-bf23-b3e74c125521	[{"Locale":"ar","Value":"الإقتصاد"},{"Locale":"en","Value":"Economy"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	6	2025-07-05 15:31:15.920574+03	\N	\N	t	\N	\N	\N	\N	f	t
49e32461-c550-49dd-b60e-ce9e7a8d934c	[{"Locale":"ar","Value":"العلوم"},{"Locale":"en","Value":"Science"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	4	2025-07-05 15:29:26.139229+03	\N	\N	t	\N	\N	\N	\N	f	t
83f1b231-6dc0-480f-8ecb-d76adc3e5b01	[{"Locale":"ar","Value":"السياسة"},{"Locale":"en","Value":"Politics"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	5	2025-07-05 15:31:09.359519+03	\N	\N	t	\N	\N	\N	\N	f	t
8dd2912c-1c65-4572-93e5-eb016e9dcf9a	[{"Locale":"ar","Value":"الإعلام"},{"Locale":"en","Value":"Media"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	2	2025-07-05 15:29:06.616006+03	\N	\N	t	\N	\N	\N	\N	f	t
8fa57464-41f2-49b2-970b-e299fe8fe4aa	[{"Locale":"ar","Value":"التقنية"},{"Locale":"en","Value":"Technology"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	1	2025-07-05 15:28:26.367922+03	\N	\N	t	\N	\N	\N	\N	f	t
f3e0f368-20f7-4bbc-ae8f-95a6043de16a	[{"Locale":"ar","Value":"الثقافة"},{"Locale":"en","Value":"Culture"}]	f	72ba37cb-c954-4b78-b7f1-92863de7e874	3	2025-07-05 15:29:14.652085+03	\N	\N	t	\N	\N	\N	\N	f	t
\.


--
-- TOC entry 4993 (class 0 OID 24577)
-- Dependencies: 232
-- Data for Name: PostCategoryVersions; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."PostCategoryVersions" ("Id", "Name", "IsDeleted", "CreatedBy", "CreatedAt", "IsPublished", "PublishedAt", "PublishedBy", "MainVersionId") FROM stdin;
\.


--
-- TOC entry 4994 (class 0 OID 24584)
-- Dependencies: 233
-- Data for Name: PostVersions; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."PostVersions" ("Id", "Title", "Description", "Link", "Image", "Meta", "Duration", "IsDeleted", "CreatedBy", "CreatedAt", "IsPublished", "PublishedAt", "PublishedBy", "MainVersionId") FROM stdin;
0d553db9-af14-43e1-bba3-171abb4631dd	 مقال تقني	 مقال تقني	https://thmanyah.com/post/18520_1jhggnmybp	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	 مقال تقني	12	f	6353d46b-53f1-4ecf-a09b-2a18e9d131ca	2025-07-12 22:15:42.557314+03	t	2025-07-12 22:48:25.758487+03	72ba37cb-c954-4b78-b7f1-92863de7e874	d62156bd-a749-4ec9-bcb8-e61011c16b95
4f0eb82e-9b25-4b58-a52e-0b5c0a9ccfa0	تجربة	تجربة	تجربة	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	تجربة	12	f	6353d46b-53f1-4ecf-a09b-2a18e9d131ca	2025-07-12 16:06:24.279526+03	t	2025-07-12 22:48:25.798035+03	72ba37cb-c954-4b78-b7f1-92863de7e874	d62156bd-a749-4ec9-bcb8-e61011c16b95
8d9781d9-caff-488f-99f1-da5af6934457	 مقال تقني	 مقال تقني	https://thmanyah.com/post/18520_1jhggnmybp	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	 مقال تقني	12	f	72ba37cb-c954-4b78-b7f1-92863de7e874	2025-07-12 23:12:27.923132+03	t	2025-07-12 23:12:27.924229+03	72ba37cb-c954-4b78-b7f1-92863de7e874	d62156bd-a749-4ec9-bcb8-e61011c16b95
bb7d8fcb-273f-4eb0-8524-99f49a256cfd	«فورمولا ون»: خسر سباق القصة	ثمة أفلام تتغذى على وهج الحماسة الأولى، وعلى تلك الدهشة البكر التي تأخذ بمجامع عقول الكبار، الذين سحرتهم الصورة، وأيقظت فيهم نشوةً متوهجة من طفولتهم. \r\n\r\nأخبرتُ صديقي بهذه العبارة عندما شاهدتُ من خلفي الكمَّ الهائل من عشّاق السيارات في قاعة السينما، في ليلةٍ أقرب إلى الوصف الأمريكي: (Boys Night). وأعني بذلك أولئك الذين كانوا، منذ نعومة أظافرهم، عشّاقًا لألعاب «هوت ويلز» ومنهم -بالنظر إلى أعمارهم- من تربّى على مسلسل الرسوم المتحركة «هيابوزا» ومن كانوا يترقّبون لحظة تحوّل سيارة النمر المقنّع أكثر من لحظة كشفه عن هويّته! \r\n\r\nعدا عن أن السيارة الخارقة في فِلم «F1: The Movie» للمخرج البارّ في السينما الأمريكية جوزيف كوسينسكي لا تشبه سيارة «كين هيابوزا» ذات الدرع الخارجي المتين، والمدجّجة بإطارات مطعّمة بأوتاد دفاعية، وزر لبث الأدخنة التضليلية، وترسانة خيالية من القنابل الأرضية. فإن سيارات الفورمولا ون تُبنى لتفادي الأعطال لا لإحداثها: أجنحة لتقليل الجرّ الذي قد يطيح بالسيارة، ومشعات جانبية تمنع احتراق وحدة الطاقة، وصفيحات تُبعد الهواء المضطرب عن الإطارات، وفِرَق صيانة تُحاسب على ضياع الجزء من الثانية. ويقود كل مركبة، مكوّنة من أكثر من خمسة عشر ألف قطعة دقيقة، مهندسون قد يصدف أن عمل بعضهم في وكالة ناسا للفضاء، كي تبقى السيارة فقط على مسار المنافسة.\r\n\r\nكل هذه التفاصيل المعنية بالفيزياء والميكانيكا نشهد عليها في الفِلم الذي يقود بطولته الممثل براد بيت، بدور المتسابق المخضرم «سوني هايز»؛ رجل حر لا يربطه منزل ولا أرض، ولا تستميله العاطفة أو الألقاب. يخوض سباقات محلية كسباقات «الناسكار»، لا لهدف سوى أن يقتات من النزر اليسير الذي تمنحه، مكتفيًا بها عن سائر الأضواء. ومع ذلك، يجتمع الناس على إكباره لكونه في شبابه قاب قوسين أو أدنى من ملامسة تخوم مراتب المجد، قبل أن ينكفئ تاركًا الساحة، وما زال أثره فيها حاضرًا.\r\n\r\nيبدأ الفِلم بحلمٍ يستحضر دم حادثته الذي لا يزال يُخضّب شارع حلبة الفورمولا ون، تلك التي هجرها قبل سنوات طويلة، لكنها ما زالت تطارده في منامه، كما لو كانت جرحًا كلما التأم كُشط، من غير حولٍ منه ولا قوة. ذلك الحلم يطلّ علينا منذ اللحظة الأولى بصورة غير مكتملة، عبر تقنية كتابية مبتذلة تُعرف بـ«الزرع»، استخدمها سيناريست الفِلم إيرين كروقر، ليغرس بذرة الفضول. ويُمهّد لاستكماله لاحقًا بالطريقة ذاتها؛ لأن اكتماله يعني مواجهة الحقيقة المؤلمة، والتحوّل الدرامي الحتمي.\r\n\r\nوليس في ذلك ما يدل على مدخل غامض، أو ما يصعب سبر غوره؛ بل هي توطئة صريحة، قُتلت ذِكرًا في عديد من الأفلام، إلى درجة أنها تفتح سؤالًا مألوفًا: هل الحوادث الواقعية تُستعاد في الأحلام لتتكرر؟\r\n\r\nلكننا نغضّ الطرف عن هذه الفجوة، بعذر السياق الدرامي الذي سرعان ما ينقلنا إلى بقية الفِلم، حيث تحضر الفرصة للبطل دون أن يطلبها، على يد «روبين» (الصديق القديم، ويؤدي دوره خافير بارديم)، الذي أصبح مالكًا ومديرًا رياضيًّا لأحد فرق الفورمولا ون، ورأى في استعادة «سوني هايز» -الذي صلح فاسده ورجع شارده- سائقًا ثانيًا مغامرةً محسوبة؛ تعيد للفريق بريقه وتذلّل صعابه وتستوضح إبهامه. \r\n\r\nلا سيّما أن سائق الفريق الأول «جوشوا» شاب يعربد بشغف هوايته، يقابل سمو الدرجة بدنو الهمة، موهوب بالفطرة لكنه يفتقر إلى الخبرة. ما يجعل من سوني، الذي شكّل انضمامه تهديدًا، القطعة المكملة في التشكيلة؛ سائق يعرف كيف يحفظ النقاط، ويعزز من ترتيب الفريق في البطولة بحجة خبرته وصبره. إلا أن هذه الأسباب التي اختير من أجلها، نجدها تتلاشى، حيث إن النزق يراوده لمجرد نسيانه ورقة الكوتشينة التي يتخذها تميمة في جيبه كلما نزل إلى الحلبة، وهذا قد يعارض سبب اختيارهم له وبالوقت نفسه يتفق مع واقع الرياضة المتطلبة للميول النزقة! \r\n\r\nبعد الانضمام، نشهد على الحيل الممتعة في الحلبة، ونقاط الاختلاف بين «سوني» و«جوشوا» والصدامات المستمرة بينهما، ثم نقطة الالتقاء التي تفتح الباب على مشهدية مشتركة. ومع هذه الشراكة الباعثة على التلاحم والتنافر في آن، يبدأ السحر السمعي البصري، والاستعراض التقني المبهر، والموسيقا التصويرية المتزامنة بإتقان شديد مع المتعة المتصاعدة. ولسان حال صديقي يردد، مع أحد المشاهد الليلية التي صمّت بها أصواتُ المحركات آذانَنا، بيتًا يقول: «راكب اللي وإن سرى بالليل ضلّي.. يبعد المنحاش ويخيّط فتوقه». وقد زاد هذا البيت من المتعة، كتعليق يهب المشهد بُعدًا شعريًّا يعمّق الأثر.\r\n\r\nولعل القارئ يلمح تحفظي تجاه القصة المفتعلة، المستلهمة من الحلم الأمريكي، حيث تُطرح الشيخوخة بوصفها عقبةً قابلة للتطويع والتركيع، ويعاد تدوير سردية الرجل الخمسيني أو الستيني الذي ينهض ليحقق حلمه، وكأن الزمن يمكن طيّه بمجرد إيمان داخلي، تمامًا كما في فِلم «روكي بالبوا» في جزئه السادس، حين عاد للحلبة بعد ثلاثين عامًا ليلقن بطل العالم للملاكمة درسًا لا يُنسى، لا بمنطق الرياضة ولا الواقع، بل بمنطق السيناريو. وكأن البطولة هنا أيضًا مفصّلة مسبقًا على مقاس براد بيت، لتخدم حضوره. \r\n\r\nلذلك، بدت القصة مألوفة في صياغتها؛ لا تُفاجئ ولا تُشاغب. حتى مع التعاون الوثيق مع سباقات فورمولا ون الأشهر في العالم، وظهور لويس هاميلتون، أحد أعظم سائقيها، منتجًا ومتسابقًا ضمن مشاهد الفِلم. وكان من الأجدى لو استلهمت القصة من واقع موثّق، كما في فِلم «Ford v Ferrari»، الذي تفوّق في سرده لقصة واقعية عن تحدٍّ صناعيّ وتنافسيّ بين فورد وفيراري في سباق لومان الشهير. أو كما في فِلم «Rush»، الذي بنى حبكته على صراع تاريخي حقيقي بين نيكي لاودا وجيمس هنت، فجاءت دراميته أكثر صدقًا واشتباكًا مع طبيعة الرياضة نفسها، وأصبح الفِلم الرياضي الأفضل على الإطلاق بالنسبة لي.\r\n\r\nولذلك فإن التعبير بإعجاب بشكل مجمل ليس سوى انزلاقٍ إلى خطيئةِ القصة، التي لا أظنها ستجدُ القبول نفسه بعد انتقالها إلى منصة أو تلفاز خالٍ من تقنيات «آيماكس» أو «دولبي».\r\n\r\nأما بالنسبة إلى الممثلين، فلم يكن براد بيت، الذي لا يكفّ عن استعراضه الجسدي وخلع قميصه، كتوم كروز في اجتهاده، إلا أنه قدّم المطلوب منه برفقة خافيير بارديم. أما البقية، فقد كان ظهورهم متواضعًا، كاستسلام من يؤمن بأن المخرج هو بطل الفِلم… وهو كذلك!\r\n\r\nولمن يود خوض هذه التجربة، فإن مشاهدة الفِلم بأفضل تقنية متوفرة مثل «آيماكس» أو «دولبي أتموس» أو «فور دي إكس»، ليست ترفًا، بل ضرورة، كي تبلغ الصورة ذروتها، ويصلك الصوت كما أراده صانعوه: عاصفًا، ودقيقًا، وغامرًا، وكأنك أحد المتسابقين داخل الحلبة.\r\n\r\nغير أن كل هذا البذخ السمعي والبصري لا يكفي لرفع التقييم العام؛ إذ تبقى الحكاية، برأيي، هي حجر الأساس لأي فِلم. لهذا، أمنحه 6 من 10، لأن الحماسة، مهما بلغت، يمكن استعادتها من لعبة إلكترونية محكمة، لكن القصة لا تُعوّض. 	تجربة	/assets/media/d4485714-f981-49c7-9505-2e2247c51737.png	ثمة أفلام تتغذى على وهج الحماسة الأولى، وعلى تلك الدهشة البكر التي تأخذ بمجامع عقول الكبار، الذين سحرتهم الصورة، وأيقظت فيهم نشوةً متوهجة من طفولتهم. 	10	f	72ba37cb-c954-4b78-b7f1-92863de7e874	2025-07-12 23:12:31.156489+03	t	2025-07-12 23:12:31.156792+03	72ba37cb-c954-4b78-b7f1-92863de7e874	11c23bd3-c55b-405c-888c-2d67865f560e
cfbcc97f-824c-4e71-b307-374cb5089681	 مقال تقني	 مقال تقني	https://thmanyah.com/post/18520_1jhggnmybp	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	 مقال تقني	12	f	6353d46b-53f1-4ecf-a09b-2a18e9d131ca	2025-07-12 23:12:44.055871+03	f	\N	\N	d62156bd-a749-4ec9-bcb8-e61011c16b95
6a5645f9-675e-4c1e-b093-b6bdc6c5234d	 مقال تقني	 مقال تقني	https://thmanyah.com/post/18520_1jhggnmybp	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	 مقال تقني	12	f	6353d46b-53f1-4ecf-a09b-2a18e9d131ca	2025-07-12 23:12:59.135325+03	f	\N	\N	d62156bd-a749-4ec9-bcb8-e61011c16b95
\.


--
-- TOC entry 4990 (class 0 OID 16457)
-- Dependencies: 229
-- Data for Name: Posts; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."Posts" ("Id", "Title", "Description", "Link", "Image", "Meta", "Duration", "PostCategoryId", "IsDeleted", "CreatedBy", "Sort", "CreatedAt", "ModifiedBy", "ModifiedAt", "IsPublished", "PublishedAt", "PublishedBy", "DeletedAt", "DeletedBy", "IsNeedDeleteApprove", "IsActive", "Type") FROM stdin;
e2681cae-8124-4303-a38e-47413b9e91a3	لا تنصحني ولا تنتظر اعتذاري	بازيد قرر في منتصف السنة يبحث عن أسلوب حياة جديد، فراح وسجل في النادي، وفي يومين بس اكتشف وعرف أشياء كثير عن النادي والتمارين! \r\n\r\nولعله تمادى وصار ينصح عبادي، وبطبيعة الحال تفلت عليه عبادي في هذي الحلقة وعبر عن استيائه من نصائح كل من هب ودب. \r\n\r\nبس مب بس هذا اللي مستاء منه عبادي، عبادي عنده مشاكل مع الاعتذار والشكر وما يعرف متى يرحل -ولا حتى يعبر-. وعرفنا في النهاية وش نوع شخصية بازيد وعبادي.\r\n\r\nالروابط\r\n\r\nihajay — حساب عبادي حجّاي على إنستقرام.\r\n\r\nosamabz — حساب أسامة بازيد على إنستقرام.\r\n\r\n—\r\n\r\nمَخرج ثمانية على إنستقرام.\r\n\r\nمَخرج ثمانية على تك توك.\r\n\r\nمَخرج ثمانية على إكس.	https://thmanyah.com/post/1m6a85nvw6_1jhggnmybp	/assets/media/d221a492-d44a-4bb1-836f-df53b1b5dfe0.png	بازيد قرر في منتصف السنة يبحث عن أسلوب حياة جديد، ولعله تمادى وصار ينصح عبادي، وبطبيعة الحال تفلت عليه عبادي في هذي الحلقة وعبر عن استيائه من نصائح كل من هب ودب.	12	8fa57464-41f2-49b2-970b-e299fe8fe4aa	f	72ba37cb-c954-4b78-b7f1-92863de7e874	3	2025-07-05 23:42:09.263708+03	\N	\N	t	\N	\N	\N	\N	f	t	0
5e8fd1aa-6faf-4542-ba70-45a5d59f6416	عدد خاص: كيف يجد الشباب منزلًا في الرياض؟ 🏡	هل للإعلام دور في الاحتلال والحروب؟\r\n\r\nوجدت مجموعة من التقنيين مؤشرًا اسمه «مقياس انحياز الإعلام» (Media Bias Meter)، ويستخدمونه لوصف حياد جرائد ومجلات أو تحيّزها في دول مثل أمريكا وكندا وبريطانيا بلغة الأرقام. \r\n\r\nكان ابتكار هذا المقياس ردًّا على المقالات المنشورة عن فلسطين على هذه المنصات، حيث وجدوا بعد تحليل الآلاف من المقالات أن اللغة التي يستخدمونها فيها تحيز واضح لصالح دولة الاحتلال وداعميها.\r\n\r\nتدّعي الصحافة الغربية أنها منبر للحياد، ويوضح هذا المقياس زيف هذا الادعاء. فالإعلام الغربي لا يستخدم لغة حيادية في ما يجري في فلسطين وباقي أوطاننا، بل يراها وسيلة لشيطنة شعوبنا وتبرير احتلالها. 🤥 \r\n\r\nفي عدد اليوم، أشارككم تجارب ثلاثة شباب انتقلوا إلى الرياض، والتحديات التي تواجههم في إيجاد السكن المناسب. وفي «علوم الحياة بلغتنا»، أوضح لكم جريمة جديدة ترتكبها الأورام الخبيثة. ونودعكم باقتباس يتأمل في تاريخ تسمية الربع الخالي. 🏜️	https://thmanyah.com/post/1m689ym5jm_1jhggnmybp	/assets/media/e0117d4e-1fe1-44c8-b8a5-c6e81ad81b89.jpg	هل للإعلام دور في الاحتلال والحروب؟  وجدت مجموعة من التقنيين مؤشرًا اسمه «مقياس انحياز الإعلام» (Media Bias Meter)، ويستخدمونه لوصف حياد جرائد ومجلات أو تحيّزها في دول مثل أمريكا وكندا وبريطانيا بلغة الأرقام. 	12	35121ed1-acc5-4224-bf23-b3e74c125521	f	72ba37cb-c954-4b78-b7f1-92863de7e874	4	2025-07-05 23:45:43.195726+03	\N	\N	t	\N	\N	\N	\N	f	t	0
d62156bd-a749-4ec9-bcb8-e61011c16b95	 مقال تقني	 مقال تقني	https://thmanyah.com/post/18520_1jhggnmybp	/assets/media/648ade0c-5374-4d18-a767-c315155e8a52.png	 مقال تقني	12	8fa57464-41f2-49b2-970b-e299fe8fe4aa	f	\N	1	2025-07-12 22:15:42.557314+03	72ba37cb-c954-4b78-b7f1-92863de7e874	2025-07-12 23:12:27.805629+03	t	2025-07-12 23:12:27.805628+03	72ba37cb-c954-4b78-b7f1-92863de7e874	\N	\N	f	t	0
11c23bd3-c55b-405c-888c-2d67865f560e	«فورمولا ون»: خسر سباق القصة	ثمة أفلام تتغذى على وهج الحماسة الأولى، وعلى تلك الدهشة البكر التي تأخذ بمجامع عقول الكبار، الذين سحرتهم الصورة، وأيقظت فيهم نشوةً متوهجة من طفولتهم. \r\n\r\nأخبرتُ صديقي بهذه العبارة عندما شاهدتُ من خلفي الكمَّ الهائل من عشّاق السيارات في قاعة السينما، في ليلةٍ أقرب إلى الوصف الأمريكي: (Boys Night). وأعني بذلك أولئك الذين كانوا، منذ نعومة أظافرهم، عشّاقًا لألعاب «هوت ويلز» ومنهم -بالنظر إلى أعمارهم- من تربّى على مسلسل الرسوم المتحركة «هيابوزا» ومن كانوا يترقّبون لحظة تحوّل سيارة النمر المقنّع أكثر من لحظة كشفه عن هويّته! \r\n\r\nعدا عن أن السيارة الخارقة في فِلم «F1: The Movie» للمخرج البارّ في السينما الأمريكية جوزيف كوسينسكي لا تشبه سيارة «كين هيابوزا» ذات الدرع الخارجي المتين، والمدجّجة بإطارات مطعّمة بأوتاد دفاعية، وزر لبث الأدخنة التضليلية، وترسانة خيالية من القنابل الأرضية. فإن سيارات الفورمولا ون تُبنى لتفادي الأعطال لا لإحداثها: أجنحة لتقليل الجرّ الذي قد يطيح بالسيارة، ومشعات جانبية تمنع احتراق وحدة الطاقة، وصفيحات تُبعد الهواء المضطرب عن الإطارات، وفِرَق صيانة تُحاسب على ضياع الجزء من الثانية. ويقود كل مركبة، مكوّنة من أكثر من خمسة عشر ألف قطعة دقيقة، مهندسون قد يصدف أن عمل بعضهم في وكالة ناسا للفضاء، كي تبقى السيارة فقط على مسار المنافسة.\r\n\r\nكل هذه التفاصيل المعنية بالفيزياء والميكانيكا نشهد عليها في الفِلم الذي يقود بطولته الممثل براد بيت، بدور المتسابق المخضرم «سوني هايز»؛ رجل حر لا يربطه منزل ولا أرض، ولا تستميله العاطفة أو الألقاب. يخوض سباقات محلية كسباقات «الناسكار»، لا لهدف سوى أن يقتات من النزر اليسير الذي تمنحه، مكتفيًا بها عن سائر الأضواء. ومع ذلك، يجتمع الناس على إكباره لكونه في شبابه قاب قوسين أو أدنى من ملامسة تخوم مراتب المجد، قبل أن ينكفئ تاركًا الساحة، وما زال أثره فيها حاضرًا.\r\n\r\nيبدأ الفِلم بحلمٍ يستحضر دم حادثته الذي لا يزال يُخضّب شارع حلبة الفورمولا ون، تلك التي هجرها قبل سنوات طويلة، لكنها ما زالت تطارده في منامه، كما لو كانت جرحًا كلما التأم كُشط، من غير حولٍ منه ولا قوة. ذلك الحلم يطلّ علينا منذ اللحظة الأولى بصورة غير مكتملة، عبر تقنية كتابية مبتذلة تُعرف بـ«الزرع»، استخدمها سيناريست الفِلم إيرين كروقر، ليغرس بذرة الفضول. ويُمهّد لاستكماله لاحقًا بالطريقة ذاتها؛ لأن اكتماله يعني مواجهة الحقيقة المؤلمة، والتحوّل الدرامي الحتمي.\r\n\r\nوليس في ذلك ما يدل على مدخل غامض، أو ما يصعب سبر غوره؛ بل هي توطئة صريحة، قُتلت ذِكرًا في عديد من الأفلام، إلى درجة أنها تفتح سؤالًا مألوفًا: هل الحوادث الواقعية تُستعاد في الأحلام لتتكرر؟\r\n\r\nلكننا نغضّ الطرف عن هذه الفجوة، بعذر السياق الدرامي الذي سرعان ما ينقلنا إلى بقية الفِلم، حيث تحضر الفرصة للبطل دون أن يطلبها، على يد «روبين» (الصديق القديم، ويؤدي دوره خافير بارديم)، الذي أصبح مالكًا ومديرًا رياضيًّا لأحد فرق الفورمولا ون، ورأى في استعادة «سوني هايز» -الذي صلح فاسده ورجع شارده- سائقًا ثانيًا مغامرةً محسوبة؛ تعيد للفريق بريقه وتذلّل صعابه وتستوضح إبهامه. \r\n\r\nلا سيّما أن سائق الفريق الأول «جوشوا» شاب يعربد بشغف هوايته، يقابل سمو الدرجة بدنو الهمة، موهوب بالفطرة لكنه يفتقر إلى الخبرة. ما يجعل من سوني، الذي شكّل انضمامه تهديدًا، القطعة المكملة في التشكيلة؛ سائق يعرف كيف يحفظ النقاط، ويعزز من ترتيب الفريق في البطولة بحجة خبرته وصبره. إلا أن هذه الأسباب التي اختير من أجلها، نجدها تتلاشى، حيث إن النزق يراوده لمجرد نسيانه ورقة الكوتشينة التي يتخذها تميمة في جيبه كلما نزل إلى الحلبة، وهذا قد يعارض سبب اختيارهم له وبالوقت نفسه يتفق مع واقع الرياضة المتطلبة للميول النزقة! \r\n\r\nبعد الانضمام، نشهد على الحيل الممتعة في الحلبة، ونقاط الاختلاف بين «سوني» و«جوشوا» والصدامات المستمرة بينهما، ثم نقطة الالتقاء التي تفتح الباب على مشهدية مشتركة. ومع هذه الشراكة الباعثة على التلاحم والتنافر في آن، يبدأ السحر السمعي البصري، والاستعراض التقني المبهر، والموسيقا التصويرية المتزامنة بإتقان شديد مع المتعة المتصاعدة. ولسان حال صديقي يردد، مع أحد المشاهد الليلية التي صمّت بها أصواتُ المحركات آذانَنا، بيتًا يقول: «راكب اللي وإن سرى بالليل ضلّي.. يبعد المنحاش ويخيّط فتوقه». وقد زاد هذا البيت من المتعة، كتعليق يهب المشهد بُعدًا شعريًّا يعمّق الأثر.\r\n\r\nولعل القارئ يلمح تحفظي تجاه القصة المفتعلة، المستلهمة من الحلم الأمريكي، حيث تُطرح الشيخوخة بوصفها عقبةً قابلة للتطويع والتركيع، ويعاد تدوير سردية الرجل الخمسيني أو الستيني الذي ينهض ليحقق حلمه، وكأن الزمن يمكن طيّه بمجرد إيمان داخلي، تمامًا كما في فِلم «روكي بالبوا» في جزئه السادس، حين عاد للحلبة بعد ثلاثين عامًا ليلقن بطل العالم للملاكمة درسًا لا يُنسى، لا بمنطق الرياضة ولا الواقع، بل بمنطق السيناريو. وكأن البطولة هنا أيضًا مفصّلة مسبقًا على مقاس براد بيت، لتخدم حضوره. \r\n\r\nلذلك، بدت القصة مألوفة في صياغتها؛ لا تُفاجئ ولا تُشاغب. حتى مع التعاون الوثيق مع سباقات فورمولا ون الأشهر في العالم، وظهور لويس هاميلتون، أحد أعظم سائقيها، منتجًا ومتسابقًا ضمن مشاهد الفِلم. وكان من الأجدى لو استلهمت القصة من واقع موثّق، كما في فِلم «Ford v Ferrari»، الذي تفوّق في سرده لقصة واقعية عن تحدٍّ صناعيّ وتنافسيّ بين فورد وفيراري في سباق لومان الشهير. أو كما في فِلم «Rush»، الذي بنى حبكته على صراع تاريخي حقيقي بين نيكي لاودا وجيمس هنت، فجاءت دراميته أكثر صدقًا واشتباكًا مع طبيعة الرياضة نفسها، وأصبح الفِلم الرياضي الأفضل على الإطلاق بالنسبة لي.\r\n\r\nولذلك فإن التعبير بإعجاب بشكل مجمل ليس سوى انزلاقٍ إلى خطيئةِ القصة، التي لا أظنها ستجدُ القبول نفسه بعد انتقالها إلى منصة أو تلفاز خالٍ من تقنيات «آيماكس» أو «دولبي».\r\n\r\nأما بالنسبة إلى الممثلين، فلم يكن براد بيت، الذي لا يكفّ عن استعراضه الجسدي وخلع قميصه، كتوم كروز في اجتهاده، إلا أنه قدّم المطلوب منه برفقة خافيير بارديم. أما البقية، فقد كان ظهورهم متواضعًا، كاستسلام من يؤمن بأن المخرج هو بطل الفِلم… وهو كذلك!\r\n\r\nولمن يود خوض هذه التجربة، فإن مشاهدة الفِلم بأفضل تقنية متوفرة مثل «آيماكس» أو «دولبي أتموس» أو «فور دي إكس»، ليست ترفًا، بل ضرورة، كي تبلغ الصورة ذروتها، ويصلك الصوت كما أراده صانعوه: عاصفًا، ودقيقًا، وغامرًا، وكأنك أحد المتسابقين داخل الحلبة.\r\n\r\nغير أن كل هذا البذخ السمعي والبصري لا يكفي لرفع التقييم العام؛ إذ تبقى الحكاية، برأيي، هي حجر الأساس لأي فِلم. لهذا، أمنحه 6 من 10، لأن الحماسة، مهما بلغت، يمكن استعادتها من لعبة إلكترونية محكمة، لكن القصة لا تُعوّض. 	تجربة	/assets/media/d4485714-f981-49c7-9505-2e2247c51737.png	ثمة أفلام تتغذى على وهج الحماسة الأولى، وعلى تلك الدهشة البكر التي تأخذ بمجامع عقول الكبار، الذين سحرتهم الصورة، وأيقظت فيهم نشوةً متوهجة من طفولتهم. 	10	8dd2912c-1c65-4572-93e5-eb016e9dcf9a	f	\N	2	2025-07-05 23:39:34.099352+03	72ba37cb-c954-4b78-b7f1-92863de7e874	2025-07-12 23:12:31.146708+03	t	2025-07-12 23:12:31.146706+03	72ba37cb-c954-4b78-b7f1-92863de7e874	\N	\N	f	t	0
\.


--
-- TOC entry 4982 (class 0 OID 16411)
-- Dependencies: 221
-- Data for Name: RoleClaims; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."RoleClaims" ("Id", "RoleId", "ClaimType", "ClaimValue") FROM stdin;
\.


--
-- TOC entry 4983 (class 0 OID 16418)
-- Dependencies: 222
-- Data for Name: RolePermissions; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."RolePermissions" ("Id", "RoleId", "PermissionId", "IsDeleted", "CreatedBy", "Sort", "CreatedAt", "ModifiedBy", "ModifiedAt", "IsPublished", "PublishedAt", "PublishedBy", "DeletedAt", "DeletedBy", "IsNeedDeleteApprove", "IsActive") FROM stdin;
54f3b408-fcdf-4d7b-950d-642f6966d1ba	d92edf42-e3cd-4832-93dd-61b7b5770cd3	062c17a9-21e5-4fe9-402c-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.522262+03	\N	\N	t	\N	\N	\N	\N	f	t
08a77e1c-bd0d-4bc7-8e00-8187a09e489e	d92edf42-e3cd-4832-93dd-61b7b5770cd3	d9a98bfa-080e-4c6b-402a-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.834002+03	\N	\N	t	\N	\N	\N	\N	f	t
7dabea27-75e6-426a-9748-96773d712455	d92edf42-e3cd-4832-93dd-61b7b5770cd3	fc484495-dec9-4cd9-402f-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.885164+03	\N	\N	t	\N	\N	\N	\N	f	t
e7b1fc8a-7678-499e-b8ba-8f55530e6c41	d92edf42-e3cd-4832-93dd-61b7b5770cd3	e0a1c562-512f-4073-4032-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.893045+03	\N	\N	t	\N	\N	\N	\N	f	t
fb8b9da0-a6bd-472e-ba18-cd24cc377591	d92edf42-e3cd-4832-93dd-61b7b5770cd3	20651947-a5a0-4e62-4030-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.895886+03	\N	\N	t	\N	\N	\N	\N	f	t
d540ed1c-0b7a-46f3-811d-0030c8bc9e16	d92edf42-e3cd-4832-93dd-61b7b5770cd3	04e87bc1-655d-4b0b-402b-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.898847+03	\N	\N	t	\N	\N	\N	\N	f	t
f32652ba-23ce-4876-aa9e-821c21cc06f5	d92edf42-e3cd-4832-93dd-61b7b5770cd3	235f2f00-1c5e-460c-4028-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.901515+03	\N	\N	t	\N	\N	\N	\N	f	t
7b1783cd-4312-492f-b3eb-83d3fef50084	d92edf42-e3cd-4832-93dd-61b7b5770cd3	aef199e5-ae5c-4334-402e-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.904395+03	\N	\N	t	\N	\N	\N	\N	f	t
459ae2cd-a5d3-4a05-bb89-db2924852c83	d92edf42-e3cd-4832-93dd-61b7b5770cd3	83ac5a1f-0e9f-48c7-402d-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.907371+03	\N	\N	t	\N	\N	\N	\N	f	t
644c4a1d-ff73-43d2-ad1d-26e42b95dc74	d92edf42-e3cd-4832-93dd-61b7b5770cd3	2c1b4d4b-3bb1-44f7-4029-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.91056+03	\N	\N	t	\N	\N	\N	\N	f	t
3dcc594f-576f-454b-b244-f25cf16a2938	d92edf42-e3cd-4832-93dd-61b7b5770cd3	6308a7f3-a865-4fac-4031-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:02:10.913713+03	\N	\N	t	\N	\N	\N	\N	f	t
0fc730df-e56c-402c-a44e-364a3935afae	92c299e6-7199-4c52-baba-acb04fa44942	04e87bc1-655d-4b0b-402b-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.73834+03	\N	\N	t	\N	\N	\N	\N	f	t
12ef1a7c-1ecb-4ad4-9270-6f58b0757daf	92c299e6-7199-4c52-baba-acb04fa44942	aef199e5-ae5c-4334-402e-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.116689+03	\N	\N	t	\N	\N	\N	\N	f	t
2c3f2552-b64b-4900-b6dc-19280954c29a	92c299e6-7199-4c52-baba-acb04fa44942	20651947-a5a0-4e62-4030-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.735617+03	\N	\N	t	\N	\N	\N	\N	f	t
3115b32c-3b55-4290-a210-080cf4709091	92c299e6-7199-4c52-baba-acb04fa44942	d9a98bfa-080e-4c6b-402a-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.09395+03	\N	\N	t	\N	\N	\N	\N	f	t
3ad01efb-daa7-429d-8e75-2b81e1012ba8	92c299e6-7199-4c52-baba-acb04fa44942	20651947-a5a0-4e62-4030-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.105832+03	\N	\N	t	\N	\N	\N	\N	f	t
3cb09146-9639-4dcd-9760-d5904b2c1db3	92c299e6-7199-4c52-baba-acb04fa44942	2c1b4d4b-3bb1-44f7-4029-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.125416+03	\N	\N	t	\N	\N	\N	\N	f	t
4871d39b-1d66-4bc6-9dc3-22f0ecda3509	92c299e6-7199-4c52-baba-acb04fa44942	d9a98bfa-080e-4c6b-402a-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.724935+03	\N	\N	t	\N	\N	\N	\N	f	t
49a03e3c-57d2-478d-8888-b6ef806b8e50	92c299e6-7199-4c52-baba-acb04fa44942	062c17a9-21e5-4fe9-402c-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.089265+03	\N	\N	t	\N	\N	\N	\N	f	t
5307dbe5-abb2-4fd6-ae6b-1dfd101665ef	92c299e6-7199-4c52-baba-acb04fa44942	6308a7f3-a865-4fac-4031-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.753401+03	\N	\N	t	\N	\N	\N	\N	f	t
70626e96-9585-485b-b56a-2f79a8e4cd96	92c299e6-7199-4c52-baba-acb04fa44942	83ac5a1f-0e9f-48c7-402d-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.120794+03	\N	\N	t	\N	\N	\N	\N	f	t
7235fc85-33d2-47fe-9aef-993e4a289fa7	92c299e6-7199-4c52-baba-acb04fa44942	83ac5a1f-0e9f-48c7-402d-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.747918+03	\N	\N	t	\N	\N	\N	\N	f	t
801d6249-58b5-439e-84fc-b944b754177f	92c299e6-7199-4c52-baba-acb04fa44942	aef199e5-ae5c-4334-402e-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.744949+03	\N	\N	t	\N	\N	\N	\N	f	t
aa53b755-0062-42c7-be34-174268a3c4c2	92c299e6-7199-4c52-baba-acb04fa44942	6308a7f3-a865-4fac-4031-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.130495+03	\N	\N	t	\N	\N	\N	\N	f	t
b74b77b9-0966-4ed0-8bda-b1a67b35e678	b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	d9a98bfa-080e-4c6b-402a-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:56.441752+03	\N	\N	t	\N	\N	\N	\N	f	t
ba3c93a8-e4c6-4b54-9d24-0fc669eed28a	b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	2c1b4d4b-3bb1-44f7-4029-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:56.464151+03	\N	\N	t	\N	\N	\N	\N	f	t
d10d4fda-4267-4ad3-8a16-82b1b76a3409	92c299e6-7199-4c52-baba-acb04fa44942	e0a1c562-512f-4073-4032-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.732973+03	\N	\N	t	\N	\N	\N	\N	f	t
d83ac942-c2af-4a36-8480-98531af58062	92c299e6-7199-4c52-baba-acb04fa44942	2c1b4d4b-3bb1-44f7-4029-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.750686+03	\N	\N	t	\N	\N	\N	\N	f	t
e5cbbc66-21c0-4cc6-a204-86aa85c33405	b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	fc484495-dec9-4cd9-402f-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:56.445638+03	\N	\N	t	\N	\N	\N	\N	f	t
ec464014-0778-4a06-8c0a-6fbaecff63cd	92c299e6-7199-4c52-baba-acb04fa44942	062c17a9-21e5-4fe9-402c-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:05.84625+03	\N	\N	t	\N	\N	\N	\N	f	t
ec92e2bb-fcfb-4816-97cc-e1eaf651505c	92c299e6-7199-4c52-baba-acb04fa44942	04e87bc1-655d-4b0b-402b-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.110188+03	\N	\N	t	\N	\N	\N	\N	f	t
f1b71400-a7c3-42bd-9bec-f3729173f01f	92c299e6-7199-4c52-baba-acb04fa44942	fc484495-dec9-4cd9-402f-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.098006+03	\N	\N	t	\N	\N	\N	\N	f	t
f33220da-058f-45c2-a6e4-ced3262943bf	92c299e6-7199-4c52-baba-acb04fa44942	fc484495-dec9-4cd9-402f-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:24.729952+03	\N	\N	t	\N	\N	\N	\N	f	t
f824ef93-e2ad-4e0c-9869-6bf36f738fa2	b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	04e87bc1-655d-4b0b-402b-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:56.45376+03	\N	\N	t	\N	\N	\N	\N	f	t
fbae41fd-c636-4dd8-8649-b6451bb5b1cb	92c299e6-7199-4c52-baba-acb04fa44942	e0a1c562-512f-4073-4032-08dbad215992	f	72ba37cb-c954-4b78-b7f1-92863de7e874	0	2025-07-05 15:19:39.101929+03	\N	\N	t	\N	\N	\N	\N	f	t
\.


--
-- TOC entry 4984 (class 0 OID 16423)
-- Dependencies: 223
-- Data for Name: Roles; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."Roles" ("Id", "Title", "IsStatic", "IsDeleted", "Name", "NormalizedName", "ConcurrencyStamp") FROM stdin;
d92edf42-e3cd-4832-93dd-61b7b5770cd3	Administrator	f	f	Administrator	ADMINISTRATOR	05b4bdf1-edff-49ff-8993-177922d517a8
92c299e6-7199-4c52-baba-acb04fa44942	Manage	f	f	Manage	MANAGE	dc679690-7201-4bad-8167-e49c3ac3655d
b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	Editor	f	f	Editor	EDITOR	d7021764-d144-478f-849d-447d882083f5
\.


--
-- TOC entry 4986 (class 0 OID 16431)
-- Dependencies: 225
-- Data for Name: UserClaims; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."UserClaims" ("Id", "UserId", "ClaimType", "ClaimValue") FROM stdin;
\.


--
-- TOC entry 4987 (class 0 OID 16438)
-- Dependencies: 226
-- Data for Name: UserLogins; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."UserLogins" ("Id", "LoginProvider", "ProviderKey", "ProviderDisplayName", "UserId") FROM stdin;
\.


--
-- TOC entry 4988 (class 0 OID 16445)
-- Dependencies: 227
-- Data for Name: UserRoles; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."UserRoles" ("Id", "UserId", "RoleId") FROM stdin;
\.


--
-- TOC entry 4989 (class 0 OID 16450)
-- Dependencies: 228
-- Data for Name: UserTokens; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."UserTokens" ("Id", "UserId", "LoginProvider", "Name", "Value") FROM stdin;
\.


--
-- TOC entry 4991 (class 0 OID 16469)
-- Dependencies: 230
-- Data for Name: Users; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."Users" ("Id", "Name", "Avatar", "RoleId", "DepartmentId", "IsDeleted", "UserName", "NormalizedUserName", "Email", "NormalizedEmail", "EmailConfirmed", "PasswordHash", "SecurityStamp", "ConcurrencyStamp", "PhoneNumber", "PhoneNumberConfirmed", "TwoFactorEnabled", "LockoutEnd", "LockoutEnabled", "AccessFailedCount") FROM stdin;
3d401953-3c2b-4ec0-8e3c-3437ca92d465	محمد خالد العاقب	\N	d92edf42-e3cd-4832-93dd-61b7b5770cd3	\N	f	al3a8eb@gmail.com	AL3A8EB@GMAIL.COM	al3a8eb@gmail.com	AL3A8EB@GMAIL.COM	f	\N	F7VGA4QQGANQCKE4AUCQOT3B6PJSDQAR	aefc23c6-77a7-4c93-ac3e-5cd1120b7d62	0536944537	f	f	\N	t	0
6353d46b-53f1-4ecf-a09b-2a18e9d131ca	محرر محتوى	\N	b6e2e5c3-1fa0-4d1d-865a-ea3ff9b9a2f6	\N	f	editor@thmanyah.com	EDITOR@THMANYAH.COM	editor@thmanyah.com	EDITOR@THMANYAH.COM	f	AQAAAAIAAYagAAAAEHdd5xbBUwMvDI+U+BKTPJSEn+PtLKIAQAYQnCsHrVVQUitu4JE3xmDSH4dTeZvHCQ==	EALNICSGMMLVKU5TJIFJIUUFH6FJDUQR	51535fff-1bb3-4bcc-91de-69c26a51a17d	0536944537	f	f	\N	t	0
72ba37cb-c954-4b78-b7f1-92863de7e874	مدير النظام	\N	d92edf42-e3cd-4832-93dd-61b7b5770cd3	\N	f	administrator@thmanyah.com	ADMINISTRATOR@THMANYAH.COM	administrator@thmanyah.com	ADMINISTRATOR@THMANYAH.COM	f	AQAAAAIAAYagAAAAEIZKwc3RPtwc2S3sc5qN0+Qu1N3TIAlHNF9smmm5PLBOmWDHR5PUK5kq3pWlIXuE1Q==	XEOXC2HDRR5Q72O3JJAR3Z5NJJDDOXZ3	45ed87a1-0aa0-41ae-9174-d193d371e888	0536944537	f	f	\N	t	0
75a20e03-8532-46a0-a4f4-118b36d64eba	مشرف محتوى	\N	92c299e6-7199-4c52-baba-acb04fa44942	\N	f	manager@thmanyah.com	MANAGER@THMANYAH.COM	manager@thmanyah.com	MANAGER@THMANYAH.COM	f	AQAAAAIAAYagAAAAELU4yCOf6asEnODkShV/FPfzT2VeolxM44Jex3vS8m6NzFaZ2dlyGyEhZzXRbjH/NQ==	TMOFT372MEJFDGAEGVYUSFJRKOETFT32	1dbbec8e-249d-496c-ac74-7e54206b47d1	0536944537	f	f	\N	t	0
\.


--
-- TOC entry 4978 (class 0 OID 16391)
-- Dependencies: 217
-- Data for Name: __EFMigrationsHistory; Type: TABLE DATA; Schema: public; Owner: postgres_user
--

COPY public."__EFMigrationsHistory" ("MigrationId", "ProductVersion") FROM stdin;
20250704112207_InitTables	8.0.17
20250704212744_AddPostCategoryTableAndLinkedWithPostTable	8.0.17
20250705105429_UpdateDatabase	8.0.17
20250712122906_AddVersionsTable	8.0.17
\.


--
-- TOC entry 5000 (class 0 OID 0)
-- Dependencies: 220
-- Name: RoleClaims_Id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres_user
--

SELECT pg_catalog.setval('public."RoleClaims_Id_seq"', 1, false);


--
-- TOC entry 5001 (class 0 OID 0)
-- Dependencies: 224
-- Name: UserClaims_Id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres_user
--

SELECT pg_catalog.setval('public."UserClaims_Id_seq"', 1, false);


-- Completed on 2025-07-17 22:21:16

--
-- PostgreSQL database dump complete
--

